zuzya3010/hoverboard-AT32F413RCT7/Drivers/AT32F4xx_HAL_Driver/Inc/at32f4xx_hal_rcc_ex.h
  uint32_t HSEPredivValue;       /*!<  The Prediv1 factor value (named PREDIV1 or PLLXTPRE in RM)
                                       This parameter can be a value of @ref RCCEx_Prediv1_Factor */

  uint32_t LSEState;              /*!<  The new state of the LSE.
                                        This parameter can be a value of @ref RCC_LSE_Config */
                                          
  uint32_t HSIState;              /*!< The new state of the HSI.
                                       This parameter can be a value of @ref RCC_HSI_Config */

  uint32_t HSICalibrationValue;   /*!< The HSI calibration trimming value (default is RCC_HSICALIBRATION_DEFAULT).
                                       This parameter must be a number between Min_Data = 0x00 and Max_Data = 0x1F */
                               
  uint32_t LSIState;              /*!<  The new state of the LSI.
                                        This parameter can be a value of @ref RCC_LSI_Config */

  RCC_PLLInitTypeDef PLL;         /*!< PLL structure parameters */      

// #if defined(STM32F105xC) || defined(STM32F107xC)
  // RCC_PLL2InitTypeDef PLL2;         /*!< PLL2 structure parameters */      
// #endif /* STM32F105xC || STM32F107xC */
} RCC_OscInitTypeDef;

// #if defined(STM32F105xC) || defined(STM32F107xC)
// /** 
  // * @brief  RCC PLLI2S configuration structure definition  
  // */
// typedef struct
// {
  // uint32_t PLLI2SMUL;         /*!< PLLI2SMUL: Multiplication factor for PLLI2S VCO input clock
                              // This parameter must be a value of @ref RCCEx_PLLI2S_Multiplication_Factor*/        

// #if defined(STM32F105xC) || defined(STM32F107xC)
  // uint32_t HSEPrediv2Value;       /*!<  The Prediv2 factor value.
                                       // This parameter can be a value of @ref RCCEx_Prediv2_Factor */

// #endif /* STM32F105xC || STM32F107xC */
// } RCC_PLLI2SInitTypeDef;
// #endif /* STM32F105xC || STM32F107xC */

/** 
  * @brief  RCC extended clocks structure definition  
  */
typedef struct
{
  uint32_t PeriphClockSelection;      /*!< The Extended Clock to be configured.
                                       This parameter can be a value of @ref RCCEx_Periph_Clock_Selection */

  uint32_t RTCClockSelection;         /*!< specifies the RTC clock source.
                                       This parameter can be a value of @ref RCC_RTC_Clock_Source */

  uint32_t AdcClockSelection;         /*!< ADC clock source      
                                       This parameter can be a value of @ref RCCEx_ADC_Prescaler */

// #if defined(STM32F103xE) || defined(STM32F103xG) || defined(STM32F105xC)\
 // || defined(STM32F107xC)
  uint32_t I2s2ClockSelection;         /*!< I2S2 clock source
                                       This parameter can be a value of @ref RCCEx_I2S2_Clock_Source */

  uint32_t I2s3ClockSelection;         /*!< I2S3 clock source
                                       This parameter can be a value of @ref RCCEx_I2S3_Clock_Source */
  
// #if defined(STM32F105xC) || defined(STM32F107xC)
  // RCC_PLLI2SInitTypeDef PLLI2S;  /*!< PLL I2S structure parameters 
                                      // This parameter will be used only when PLLI2S is selected as Clock Source I2S2 or I2S3 */

// #endif /* STM32F105xC || STM32F107xC */
// #endif /* STM32F103xE || STM32F103xG || STM32F105xC || STM32F107xC */

// #if defined(STM32F102x6) || defined(STM32F102xB) || defined(STM32F103x6)\
 // || defined(STM32F103xB) || defined(STM32F103xE) || defined(STM32F103xG)\
 // || defined(STM32F105xC) || defined(STM32F107xC)
  uint32_t UsbClockSelection;         /*!< USB clock source      
                                       This parameter can be a value of @ref RCCEx_USB_Prescaler */

// #endif /* STM32F102x6 || STM32F102xB || STM32F103x6 || STM32F103xB || STM32F103xE || STM32F103xG || STM32F105xC || STM32F107xC */
} RCC_PeriphCLKInitTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup RCCEx_Exported_Constants RCCEx Exported Constants
  * @{
  */

/** @defgroup RCCEx_Periph_Clock_Selection Periph Clock Selection
  * @{
  */
#define RCC_PERIPHCLK_RTC           0x00000001U
#define RCC_PERIPHCLK_ADC           0x00000002U
// #if defined(STM32F103xE) || defined(STM32F103xG) || defined(STM32F105xC)\
 // || defined(STM32F107xC)
#define RCC_PERIPHCLK_I2S2          0x00000004U
#define RCC_PERIPHCLK_I2S3          0x00000008U
// #endif /* STM32F103xE || STM32F103xG || STM32F105xC || STM32F107xC */
// #if defined(STM32F102x6) || defined(STM32F102xB) || defined(STM32F103x6)\
 // || defined(STM32F103xB) || defined(STM32F103xE) || defined(STM32F103xG)\
 // || defined(STM32F105xC) || defined(STM32F107xC)
#define RCC_PERIPHCLK_USB          0x00000010U
// #endif /* STM32F102x6 || STM32F102xB || STM32F103x6 || STM32F103xB || STM32F103xE || STM32F103xG || STM32F105xC || STM32F107xC */

/**
  * @}
  */

/** @defgroup RCCEx_ADC_Prescaler ADC Prescaler
  * @{
  */
#define RCC_ADCPCLK2_DIV2              RCC_CFGR_ADCPRE_DIV2
#define RCC_ADCPCLK2_DIV4              RCC_CFGR_ADCPRE_DIV4
#define RCC_ADCPCLK2_DIV6              RCC_CFGR_ADCPRE_DIV6
#define RCC_ADCPCLK2_DIV8              RCC_CFGR_ADCPRE_DIV8

/**
  * @}
  */

// #if defined(STM32F103xE) || defined(STM32F103xG) || defined(STM32F105xC)\
 // || defined(STM32F107xC)
/** @defgroup RCCEx_I2S2_Clock_Source I2S2 Clock Source
  * @{
  */
#define RCC_I2S2CLKSOURCE_SYSCLK              0x00000000U
// #if defined(STM32F105xC) || defined(STM32F107xC)
// #define RCC_I2S2CLKSOURCE_PLLI2S_VCO          RCC_CFGR2_I2S2SRC
// #endif /* STM32F105xC || STM32F107xC */

/**
  * @}
  */

/** @defgroup RCCEx_I2S3_Clock_Source I2S3 Clock Source
  * @{
  */
#define RCC_I2S3CLKSOURCE_SYSCLK              0x00000000U
// #if defined(STM32F105xC) || defined(STM32F107xC)
// #define RCC_I2S3CLKSOURCE_PLLI2S_VCO          RCC_CFGR2_I2S3SRC
// #endif /* STM32F105xC || STM32F107xC */

/**
  * @}
  */

// #endif /* STM32F103xE || STM32F103xG || STM32F105xC || STM32F107xC */

// #if defined(STM32F102x6) || defined(STM32F102xB) || defined(STM32F103x6)\
 // || defined(STM32F103xB) || defined(STM32F103xE) || defined(STM32F103xG)

/** @defgroup RCCEx_USB_Prescaler USB Prescaler
  * @{
  */
#define RCC_USBCLKSOURCE_PLL              RCC_CFGR_USBPRE
#define RCC_USBCLKSOURCE_PLL_DIV1_5       0x00000000U

/**
  * @}
  */

// #endif /* STM32F102x6 || STM32F102xB || STM32F103x6 || STM32F103xB || STM32F103xE || STM32F103xG */


// #if defined(STM32F105xC) || defined(STM32F107xC)
// /** @defgroup RCCEx_USB_Prescaler USB Prescaler
  // * @{
  // */
// #define RCC_USBCLKSOURCE_PLL_DIV2              RCC_CFGR_OTGFSPRE
// #define RCC_USBCLKSOURCE_PLL_DIV3              0x00000000U

