zuzya3010/hoverboard-AT32F413RCT7/Drivers/AT32F4xx_HAL_Driver/Inc/at32f4xx_hal_rcc_ex.h
// /**
  // * @}
  // */

// /** @defgroup RCCEx_PLLI2S_Multiplication_Factor PLLI2S Multiplication Factor
  // * @{
  // */

// #define RCC_PLLI2S_MUL8                   RCC_CFGR2_PLL3MUL8   /*!< PLLI2S input clock * 8 */
// #define RCC_PLLI2S_MUL9                   RCC_CFGR2_PLL3MUL9   /*!< PLLI2S input clock * 9 */
// #define RCC_PLLI2S_MUL10                  RCC_CFGR2_PLL3MUL10  /*!< PLLI2S input clock * 10 */
// #define RCC_PLLI2S_MUL11                  RCC_CFGR2_PLL3MUL11  /*!< PLLI2S input clock * 11 */
// #define RCC_PLLI2S_MUL12                  RCC_CFGR2_PLL3MUL12  /*!< PLLI2S input clock * 12 */
// #define RCC_PLLI2S_MUL13                  RCC_CFGR2_PLL3MUL13  /*!< PLLI2S input clock * 13 */
// #define RCC_PLLI2S_MUL14                  RCC_CFGR2_PLL3MUL14  /*!< PLLI2S input clock * 14 */
// #define RCC_PLLI2S_MUL16                  RCC_CFGR2_PLL3MUL16  /*!< PLLI2S input clock * 16 */
// #define RCC_PLLI2S_MUL20                  RCC_CFGR2_PLL3MUL20  /*!< PLLI2S input clock * 20 */

// /**
  // * @}
  // */
// #endif /* STM32F105xC || STM32F107xC */

// #if defined(STM32F105xC) || defined(STM32F107xC)
// /** @defgroup RCCEx_Prediv1_Source Prediv1 Source
  // * @{
  // */

// #define RCC_PREDIV1_SOURCE_HSE           RCC_CFGR2_PREDIV1SRC_HSE
// #define RCC_PREDIV1_SOURCE_PLL2          RCC_CFGR2_PREDIV1SRC_PLL2

// /**
  // * @}
  // */
// #endif /* STM32F105xC || STM32F107xC */

/** @defgroup RCCEx_Prediv1_Factor HSE Prediv1 Factor
  * @{
  */

#define RCC_HSE_PREDIV_DIV1              0x00000000U

// #if defined(STM32F105xC) || defined(STM32F107xC) || defined(STM32F100xB)\
 // || defined(STM32F100xE)
// #define RCC_HSE_PREDIV_DIV2              RCC_CFGR2_PREDIV1_DIV2
// #define RCC_HSE_PREDIV_DIV3              RCC_CFGR2_PREDIV1_DIV3
// #define RCC_HSE_PREDIV_DIV4              RCC_CFGR2_PREDIV1_DIV4
// #define RCC_HSE_PREDIV_DIV5              RCC_CFGR2_PREDIV1_DIV5
// #define RCC_HSE_PREDIV_DIV6              RCC_CFGR2_PREDIV1_DIV6
// #define RCC_HSE_PREDIV_DIV7              RCC_CFGR2_PREDIV1_DIV7
// #define RCC_HSE_PREDIV_DIV8              RCC_CFGR2_PREDIV1_DIV8
// #define RCC_HSE_PREDIV_DIV9              RCC_CFGR2_PREDIV1_DIV9
// #define RCC_HSE_PREDIV_DIV10             RCC_CFGR2_PREDIV1_DIV10
// #define RCC_HSE_PREDIV_DIV11             RCC_CFGR2_PREDIV1_DIV11
// #define RCC_HSE_PREDIV_DIV12             RCC_CFGR2_PREDIV1_DIV12
// #define RCC_HSE_PREDIV_DIV13             RCC_CFGR2_PREDIV1_DIV13
// #define RCC_HSE_PREDIV_DIV14             RCC_CFGR2_PREDIV1_DIV14
// #define RCC_HSE_PREDIV_DIV15             RCC_CFGR2_PREDIV1_DIV15
// #define RCC_HSE_PREDIV_DIV16             RCC_CFGR2_PREDIV1_DIV16
// #else
#define RCC_HSE_PREDIV_DIV2              RCC_CFGR_PLLXTPRE
// #endif /* STM32F105xC || STM32F107xC || STM32F100xB || STM32F100xE */

/**
  * @}
  */

// #if defined(STM32F105xC) || defined(STM32F107xC)
// /** @defgroup RCCEx_Prediv2_Factor HSE Prediv2 Factor
  // * @{
  // */

// #define RCC_HSE_PREDIV2_DIV1                RCC_CFGR2_PREDIV2_DIV1   /*!< PREDIV2 input clock not divided */
// #define RCC_HSE_PREDIV2_DIV2                RCC_CFGR2_PREDIV2_DIV2   /*!< PREDIV2 input clock divided by 2 */
// #define RCC_HSE_PREDIV2_DIV3                RCC_CFGR2_PREDIV2_DIV3   /*!< PREDIV2 input clock divided by 3 */
// #define RCC_HSE_PREDIV2_DIV4                RCC_CFGR2_PREDIV2_DIV4   /*!< PREDIV2 input clock divided by 4 */
// #define RCC_HSE_PREDIV2_DIV5                RCC_CFGR2_PREDIV2_DIV5   /*!< PREDIV2 input clock divided by 5 */
// #define RCC_HSE_PREDIV2_DIV6                RCC_CFGR2_PREDIV2_DIV6   /*!< PREDIV2 input clock divided by 6 */
// #define RCC_HSE_PREDIV2_DIV7                RCC_CFGR2_PREDIV2_DIV7   /*!< PREDIV2 input clock divided by 7 */
// #define RCC_HSE_PREDIV2_DIV8                RCC_CFGR2_PREDIV2_DIV8   /*!< PREDIV2 input clock divided by 8 */
// #define RCC_HSE_PREDIV2_DIV9                RCC_CFGR2_PREDIV2_DIV9   /*!< PREDIV2 input clock divided by 9 */
// #define RCC_HSE_PREDIV2_DIV10               RCC_CFGR2_PREDIV2_DIV10  /*!< PREDIV2 input clock divided by 10 */
// #define RCC_HSE_PREDIV2_DIV11               RCC_CFGR2_PREDIV2_DIV11  /*!< PREDIV2 input clock divided by 11 */
// #define RCC_HSE_PREDIV2_DIV12               RCC_CFGR2_PREDIV2_DIV12  /*!< PREDIV2 input clock divided by 12 */
// #define RCC_HSE_PREDIV2_DIV13               RCC_CFGR2_PREDIV2_DIV13  /*!< PREDIV2 input clock divided by 13 */
// #define RCC_HSE_PREDIV2_DIV14               RCC_CFGR2_PREDIV2_DIV14  /*!< PREDIV2 input clock divided by 14 */
// #define RCC_HSE_PREDIV2_DIV15               RCC_CFGR2_PREDIV2_DIV15  /*!< PREDIV2 input clock divided by 15 */
// #define RCC_HSE_PREDIV2_DIV16               RCC_CFGR2_PREDIV2_DIV16  /*!< PREDIV2 input clock divided by 16 */

// /**
  // * @}
  // */

// /** @defgroup RCCEx_PLL2_Config PLL Config
  // * @{
  // */
// #define RCC_PLL2_NONE                      0x00000000U
// #define RCC_PLL2_OFF                       0x00000001U
// #define RCC_PLL2_ON                        0x00000002U

// /**
  // * @}
  // */

// /** @defgroup RCCEx_PLL2_Multiplication_Factor PLL2 Multiplication Factor
  // * @{
  // */

// #define RCC_PLL2_MUL8                   RCC_CFGR2_PLL2MUL8   /*!< PLL2 input clock * 8 */
// #define RCC_PLL2_MUL9                   RCC_CFGR2_PLL2MUL9   /*!< PLL2 input clock * 9 */
// #define RCC_PLL2_MUL10                  RCC_CFGR2_PLL2MUL10  /*!< PLL2 input clock * 10 */
// #define RCC_PLL2_MUL11                  RCC_CFGR2_PLL2MUL11  /*!< PLL2 input clock * 11 */
// #define RCC_PLL2_MUL12                  RCC_CFGR2_PLL2MUL12  /*!< PLL2 input clock * 12 */
// #define RCC_PLL2_MUL13                  RCC_CFGR2_PLL2MUL13  /*!< PLL2 input clock * 13 */
// #define RCC_PLL2_MUL14                  RCC_CFGR2_PLL2MUL14  /*!< PLL2 input clock * 14 */
// #define RCC_PLL2_MUL16                  RCC_CFGR2_PLL2MUL16  /*!< PLL2 input clock * 16 */
// #define RCC_PLL2_MUL20                  RCC_CFGR2_PLL2MUL20  /*!< PLL2 input clock * 20 */

// /**
  // * @}
  // */

// #endif /* STM32F105xC || STM32F107xC */

/** @defgroup RCCEx_PLL_Multiplication_Factor PLL Multiplication Factor
  * @{
  */

// #if defined(STM32F105xC) || defined(STM32F107xC)
// #else
// #define RCC_PLL_MUL2                    RCC_CFGR_PLLMULL2
// #define RCC_PLL_MUL3                    RCC_CFGR_PLLMULL3
// #endif /* STM32F105xC || STM32F107xC */
// #define RCC_PLL_MUL4                    RCC_CFGR_PLLMULL4
// #define RCC_PLL_MUL5                    RCC_CFGR_PLLMULL5
// #define RCC_PLL_MUL6                    RCC_CFGR_PLLMULL6
// #define RCC_PLL_MUL7                    RCC_CFGR_PLLMULL7
// #define RCC_PLL_MUL8                    RCC_CFGR_PLLMULL8
// #define RCC_PLL_MUL9                    RCC_CFGR_PLLMULL9
// #if defined(STM32F105xC) || defined(STM32F107xC)
// #define RCC_PLL_MUL6_5                  RCC_CFGR_PLLMULL6_5
// #else
// #define RCC_PLL_MUL10                   RCC_CFGR_PLLMULL10
// #define RCC_PLL_MUL11                   RCC_CFGR_PLLMULL11
// #define RCC_PLL_MUL12                   RCC_CFGR_PLLMULL12
// #define RCC_PLL_MUL13                   RCC_CFGR_PLLMULL13
// #define RCC_PLL_MUL14                   RCC_CFGR_PLLMULL14
// #define RCC_PLL_MUL15                   RCC_CFGR_PLLMULL15
// #define RCC_PLL_MUL16                   RCC_CFGR_PLLMULL16
// #endif /* STM32F105xC || STM32F107xC */

/**
  * @}
  */

