zuzya3010/hoverboard-AT32F413RCT7/Drivers/AT32F4xx_HAL_Driver/Inc/at32f4xx_hal_rcc_ex.h
/** @defgroup RCCEx_MCO1_Clock_Source MCO1 Clock Source
  * @{
  */
#define RCC_MCO1SOURCE_NOCLOCK           ((uint32_t)RCC_CFGR_MCO_NOCLOCK)
#define RCC_MCO1SOURCE_SYSCLK            ((uint32_t)RCC_CFGR_MCO_SYSCLK)
#define RCC_MCO1SOURCE_HSI               ((uint32_t)RCC_CFGR_MCO_HSI)
#define RCC_MCO1SOURCE_HSE               ((uint32_t)RCC_CFGR_MCO_HSE)
#define RCC_MCO1SOURCE_PLLCLK            ((uint32_t)RCC_CFGR_MCO_PLLCLK_DIV2)
// #if defined(STM32F105xC) || defined(STM32F107xC)
// #define RCC_MCO1SOURCE_PLL2CLK           ((uint32_t)RCC_CFGR_MCO_PLL2CLK)
// #define RCC_MCO1SOURCE_PLL3CLK_DIV2      ((uint32_t)RCC_CFGR_MCO_PLL3CLK_DIV2)
// #define RCC_MCO1SOURCE_EXT_HSE           ((uint32_t)RCC_CFGR_MCO_EXT_HSE)
// #define RCC_MCO1SOURCE_PLL3CLK           ((uint32_t)RCC_CFGR_MCO_PLL3CLK)
// #endif /* STM32F105xC || STM32F107xC*/
/**
  * @}
  */

// #if defined(STM32F105xC) || defined(STM32F107xC)
// /** @defgroup RCCEx_Interrupt RCCEx Interrupt
  // * @{
  // */
// #define RCC_IT_PLL2RDY                   ((uint8_t)RCC_CIR_PLL2RDYF)
// #define RCC_IT_PLLI2SRDY                 ((uint8_t)RCC_CIR_PLL3RDYF)
// /**
  // * @}
  // */  

// /** @defgroup RCCEx_Flag RCCEx Flag
  // *        Elements values convention: 0XXYYYYYb
  // *           - YYYYY  : Flag position in the register
  // *           - XX  : Register index
  // *                 - 01: CR register
  // * @{
  // */
// /* Flags in the CR register */
// #define RCC_FLAG_PLL2RDY                  ((uint8_t)((CR_REG_INDEX << 5U) | RCC_CR_PLL2RDY_Pos))
// #define RCC_FLAG_PLLI2SRDY                ((uint8_t)((CR_REG_INDEX << 5U) | RCC_CR_PLL3RDY_Pos))
// /**
  // * @}
  // */ 
// #endif /* STM32F105xC || STM32F107xC*/

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Macros RCCEx Exported Macros
 * @{
 */

/** @defgroup RCCEx_Peripheral_Clock_Enable_Disable Peripheral Clock Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before 
  *         using it.   
  * @{
  */

// #if defined(STM32F101xE) || defined(STM32F103xE) || defined(STM32F101xG)\
 // || defined(STM32F103xG) || defined(STM32F105xC) || defined  (STM32F107xC)\
 // || defined  (STM32F100xE)
#define __HAL_RCC_DMA2_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->AHBENR, RCC_AHBENR_DMA2EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->AHBENR, RCC_AHBENR_DMA2EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_DMA2_CLK_DISABLE()        (RCC->AHBENR &= ~(RCC_AHBENR_DMA2EN))
// #endif /* STM32F101xE || STM32F103xE || STM32F101xG || STM32F103xG || STM32F105xC || STM32F107xC || STM32F100xE */

// #if defined(STM32F101xE) || defined(STM32F103xE) || defined(STM32F101xG)\
 // || defined(STM32F103xG) || defined  (STM32F100xE)
#define __HAL_RCC_FSMC_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->AHBENR, RCC_AHBENR_FSMCEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->AHBENR, RCC_AHBENR_FSMCEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_FSMC_CLK_DISABLE()        (RCC->AHBENR &= ~(RCC_AHBENR_FSMCEN))
// #endif /* STM32F101xE || STM32F103xE || STM32F101xG || STM32F103xG || STM32F100xE */

// #if defined(STM32F103xE) || defined(STM32F103xG)
#define __HAL_RCC_SDIO_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->AHBENR, RCC_AHBENR_SDIOEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->AHBENR, RCC_AHBENR_SDIOEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)


#define __HAL_RCC_SDIO_CLK_DISABLE()        (RCC->AHBENR &= ~(RCC_AHBENR_SDIOEN))
// #endif /* STM32F103xE || STM32F103xG */

// #if defined(STM32F105xC) || defined(STM32F107xC)
// #define __HAL_RCC_USB_OTG_FS_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->AHBENR, RCC_AHBENR_OTGFSEN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->AHBENR, RCC_AHBENR_OTGFSEN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)


// #define __HAL_RCC_USB_OTG_FS_CLK_DISABLE()       (RCC->AHBENR &= ~(RCC_AHBENR_OTGFSEN))
// #endif /* STM32F105xC || STM32F107xC*/

// #if defined(STM32F107xC)
// #define __HAL_RCC_ETHMAC_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->AHBENR, RCC_AHBENR_ETHMACEN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->AHBENR, RCC_AHBENR_ETHMACEN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_ETHMACTX_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->AHBENR, RCC_AHBENR_ETHMACTXEN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->AHBENR, RCC_AHBENR_ETHMACTXEN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

