zuzya3010/hoverboard-AT32F413RCT7/Drivers/AT32F4xx_HAL_Driver/Inc/at32f4xx_hal_rcc_ex.h
// #define __HAL_RCC_TIM7_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM7EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM7EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_DAC_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB1ENR, RCC_APB1ENR_DACEN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_DACEN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_CEC_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB1ENR, RCC_APB1ENR_CECEN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_CECEN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_TIM6_CLK_DISABLE()        (RCC->APB1ENR &= ~(RCC_APB1ENR_TIM6EN))
// #define __HAL_RCC_TIM7_CLK_DISABLE()        (RCC->APB1ENR &= ~(RCC_APB1ENR_TIM7EN))
// #define __HAL_RCC_DAC_CLK_DISABLE()         (RCC->APB1ENR &= ~(RCC_APB1ENR_DACEN))
// #define __HAL_RCC_CEC_CLK_DISABLE()         (RCC->APB1ENR &= ~(RCC_APB1ENR_CECEN))
// #endif /* STM32F100xB || STM32F100xE */

// #ifdef STM32F100xE
// #define __HAL_RCC_TIM5_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM5EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM5EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_TIM12_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM12EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM12EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_TIM13_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM13EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM13EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_TIM14_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM14EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM14EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_SPI3_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB1ENR, RCC_APB1ENR_SPI3EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_SPI3EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_UART4_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB1ENR, RCC_APB1ENR_UART4EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_UART4EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_UART5_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB1ENR, RCC_APB1ENR_UART5EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_UART5EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_TIM5_CLK_DISABLE()        (RCC->APB1ENR &= ~(RCC_APB1ENR_TIM5EN))
// #define __HAL_RCC_TIM12_CLK_DISABLE()       (RCC->APB1ENR &= ~(RCC_APB1ENR_TIM12EN))
// #define __HAL_RCC_TIM13_CLK_DISABLE()       (RCC->APB1ENR &= ~(RCC_APB1ENR_TIM13EN))
// #define __HAL_RCC_TIM14_CLK_DISABLE()       (RCC->APB1ENR &= ~(RCC_APB1ENR_TIM14EN))
// #define __HAL_RCC_SPI3_CLK_DISABLE()        (RCC->APB1ENR &= ~(RCC_APB1ENR_SPI3EN))
// #define __HAL_RCC_UART4_CLK_DISABLE()       (RCC->APB1ENR &= ~(RCC_APB1ENR_UART4EN))
// #define __HAL_RCC_UART5_CLK_DISABLE()       (RCC->APB1ENR &= ~(RCC_APB1ENR_UART5EN))
// #endif /* STM32F100xE */

// #if defined(STM32F105xC) || defined(STM32F107xC)
// #define __HAL_RCC_CAN2_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB1ENR, RCC_APB1ENR_CAN2EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_CAN2EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

