zuzya3010/hoverboard-AT32F413RCT7/Drivers/AT32F4xx_HAL_Driver/Inc/at32f4xx_hal_rcc_ex.h
#define __HAL_RCC_ADC2_CLK_DISABLE()        (RCC->APB2ENR &= ~(RCC_APB2ENR_ADC2EN))
// #endif /* STM32F101xG || STM32F103x6 || STM32F103xB || STM32F105xC || STM32F107xC || STM32F103xE || STM32F103xG */

// #if defined(STM32F100xB) || defined(STM32F100xE)
// #define __HAL_RCC_TIM15_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM15EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM15EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_TIM16_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM16EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM16EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_TIM17_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM17EN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM17EN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_TIM15_CLK_DISABLE()       (RCC->APB2ENR &= ~(RCC_APB2ENR_TIM15EN))
// #define __HAL_RCC_TIM16_CLK_DISABLE()       (RCC->APB2ENR &= ~(RCC_APB2ENR_TIM16EN))
// #define __HAL_RCC_TIM17_CLK_DISABLE()       (RCC->APB2ENR &= ~(RCC_APB2ENR_TIM17EN))
// #endif /* STM32F100xB || STM32F100xE */

// #if defined(STM32F100xE) || defined(STM32F101xB) || defined(STM32F101xE)\
 // || defined(STM32F101xG) || defined(STM32F100xB) || defined(STM32F103xB)\
 // || defined(STM32F103xE) || defined(STM32F103xG) || defined(STM32F105xC)\
 // || defined(STM32F107xC)
#define __HAL_RCC_GPIOE_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPEEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPEEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_GPIOE_CLK_DISABLE()       (RCC->APB2ENR &= ~(RCC_APB2ENR_IOPEEN))
// #endif /* STM32F101x6 || STM32F101xB || STM32F101xE || (...) || STM32F105xC || STM32F107xC */

// #if defined(STM32F101xE) || defined(STM32F103xE) || defined(STM32F101xG)\
 // || defined(STM32F103xG)
#define __HAL_RCC_GPIOF_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPFEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPFEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_GPIOG_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPGEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPGEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_GPIOF_CLK_DISABLE()       (RCC->APB2ENR &= ~(RCC_APB2ENR_IOPFEN))
#define __HAL_RCC_GPIOG_CLK_DISABLE()       (RCC->APB2ENR &= ~(RCC_APB2ENR_IOPGEN))
// #endif /* STM32F101xE || STM32F103xE || STM32F101xG || STM32F103xG*/

// #if defined(STM32F103xE) || defined(STM32F103xG)
#define __HAL_RCC_TIM8_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM8EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM8EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_ADC3_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB2ENR, RCC_APB2ENR_ADC3EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_ADC3EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_TIM8_CLK_DISABLE()        (RCC->APB2ENR &= ~(RCC_APB2ENR_TIM8EN))
#define __HAL_RCC_ADC3_CLK_DISABLE()        (RCC->APB2ENR &= ~(RCC_APB2ENR_ADC3EN))
// #endif /* STM32F103xE || STM32F103xG */

// #if defined(STM32F100xE)
// #define __HAL_RCC_GPIOF_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPFEN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPFEN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

// #define __HAL_RCC_GPIOG_CLK_ENABLE()   do { \
                                        // __IO uint32_t tmpreg; \
                                        // SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPGEN);\
                                        // /* Delay after an RCC peripheral clock enabling */ \
                                        // tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPGEN);\
                                        // UNUSED(tmpreg); \
                                      // } while(0U)

