zuzya3010/hoverboard-AT32F413RCT7/Drivers/AT32F4xx_HAL_Driver/Inc/at32f4xx_hal_rcc_ex.h
#define __HAL_RCC_GPIOE_RELEASE_RESET()     (RCC->APB2RSTR &= ~(RCC_APB2RSTR_IOPERST))
// #endif /* STM32F101x6 || STM32F101xB || STM32F101xE || (...) || STM32F105xC || STM32F107xC */

// #if defined(STM32F101xE) || defined(STM32F103xE) || defined(STM32F101xG)\
 // || defined(STM32F103xG)
#define __HAL_RCC_GPIOF_FORCE_RESET()       (RCC->APB2RSTR |= (RCC_APB2RSTR_IOPFRST))
#define __HAL_RCC_GPIOG_FORCE_RESET()       (RCC->APB2RSTR |= (RCC_APB2RSTR_IOPGRST))

#define __HAL_RCC_GPIOF_RELEASE_RESET()     (RCC->APB2RSTR &= ~(RCC_APB2RSTR_IOPFRST))
#define __HAL_RCC_GPIOG_RELEASE_RESET()     (RCC->APB2RSTR &= ~(RCC_APB2RSTR_IOPGRST))
// #endif /* STM32F101xE || STM32F103xE || STM32F101xG || STM32F103xG*/

// #if defined(STM32F103xE) || defined(STM32F103xG)
#define __HAL_RCC_TIM8_FORCE_RESET()        (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM8RST))
#define __HAL_RCC_ADC3_FORCE_RESET()        (RCC->APB2RSTR |= (RCC_APB2RSTR_ADC3RST))

#define __HAL_RCC_TIM8_RELEASE_RESET()      (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM8RST))
#define __HAL_RCC_ADC3_RELEASE_RESET()      (RCC->APB2RSTR &= ~(RCC_APB2RSTR_ADC3RST))
// #endif /* STM32F103xE || STM32F103xG */

// #if defined(STM32F100xE)
// #define __HAL_RCC_GPIOF_FORCE_RESET()       (RCC->APB2RSTR |= (RCC_APB2RSTR_IOPFRST))
// #define __HAL_RCC_GPIOG_FORCE_RESET()       (RCC->APB2RSTR |= (RCC_APB2RSTR_IOPGRST))

// #define __HAL_RCC_GPIOF_RELEASE_RESET()     (RCC->APB2RSTR &= ~(RCC_APB2RSTR_IOPFRST))
// #define __HAL_RCC_GPIOG_RELEASE_RESET()     (RCC->APB2RSTR &= ~(RCC_APB2RSTR_IOPGRST))
// #endif /* STM32F100xE */

// #if defined(STM32F101xG) || defined(STM32F103xG)
// #define __HAL_RCC_TIM9_FORCE_RESET()        (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM9RST))
// #define __HAL_RCC_TIM10_FORCE_RESET()       (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM10RST))
// #define __HAL_RCC_TIM11_FORCE_RESET()       (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM11RST))

// #define __HAL_RCC_TIM9_RELEASE_RESET()      (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM9RST))
// #define __HAL_RCC_TIM10_RELEASE_RESET()     (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM10RST))
// #define __HAL_RCC_TIM11_RELEASE_RESET()     (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM11RST))
// #endif /* STM32F101xG || STM32F103xG*/

/**
  * @}
  */

/** @defgroup RCCEx_HSE_Configuration HSE Configuration
  * @{   
  */ 

// #if defined(STM32F105xC) || defined(STM32F107xC) || defined(STM32F100xB)\
 // || defined(STM32F100xE)
// /**
  // * @brief  Macro to configure the External High Speed oscillator (HSE) Predivision factor for PLL.
  // * @note   Predivision factor can not be changed if PLL is used as system clock
  // *         In this case, you have to select another source of the system clock, disable the PLL and
  // *         then change the HSE predivision factor.
  // * @param  __HSE_PREDIV_VALUE__ specifies the division value applied to HSE.
  // *         This parameter must be a number between RCC_HSE_PREDIV_DIV1 and RCC_HSE_PREDIV_DIV16.
  // */
// #define __HAL_RCC_HSE_PREDIV_CONFIG(__HSE_PREDIV_VALUE__) MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PREDIV1, (uint32_t)(__HSE_PREDIV_VALUE__))
// #else
// /**
  // * @brief  Macro to configure the External High Speed oscillator (HSE) Predivision factor for PLL.
  // * @note   Predivision factor can not be changed if PLL is used as system clock
  // *         In this case, you have to select another source of the system clock, disable the PLL and
  // *         then change the HSE predivision factor.
  // * @param  __HSE_PREDIV_VALUE__ specifies the division value applied to HSE.
  // *         This parameter must be a number between RCC_HSE_PREDIV_DIV1 and RCC_HSE_PREDIV_DIV2.
  // */
// #define __HAL_RCC_HSE_PREDIV_CONFIG(__HSE_PREDIV_VALUE__) \
                  // MODIFY_REG(RCC->CFGR,RCC_CFGR_PLLXTPRE, (uint32_t)(__HSE_PREDIV_VALUE__))

// #endif /* STM32F105xC || STM32F107xC */

// #if defined(STM32F105xC) || defined(STM32F107xC) || defined(STM32F100xB)\
 // || defined(STM32F100xE)
// /**
  // * @brief  Macro to get prediv1 factor for PLL.
  // */
// #define __HAL_RCC_HSE_GET_PREDIV() READ_BIT(RCC->CFGR2, RCC_CFGR2_PREDIV1)

// #else
/**
  * @brief  Macro to get prediv1 factor for PLL.
  */
#define __HAL_RCC_HSE_GET_PREDIV() READ_BIT(RCC->CFGR, RCC_CFGR_PLLXTPRE)

// #endif /* STM32F105xC || STM32F107xC || STM32F100xB || STM32F100xE */

/**
  * @}
  */

// #if defined(STM32F105xC) || defined(STM32F107xC)
// /** @defgroup RCCEx_PLLI2S_Configuration PLLI2S Configuration
  // * @{   
  // */ 

// /** @brief Macros to enable the main PLLI2S.
  // * @note   After enabling the main PLLI2S, the application software should wait on 
  // *         PLLI2SRDY flag to be set indicating that PLLI2S clock is stable and can
  // *         be used as system clock source.
  // * @note   The main PLLI2S is disabled by hardware when entering STOP and STANDBY modes.
  // */
// #define __HAL_RCC_PLLI2S_ENABLE()          (*(__IO uint32_t *) RCC_CR_PLLI2SON_BB = ENABLE)

// /** @brief Macros to disable the main PLLI2S.
  // * @note   The main PLLI2S is disabled by hardware when entering STOP and STANDBY modes.
  // */
// #define __HAL_RCC_PLLI2S_DISABLE()         (*(__IO uint32_t *) RCC_CR_PLLI2SON_BB = DISABLE)

// /** @brief macros to configure the main PLLI2S multiplication factor.
  // * @note   This function must be used only when the main PLLI2S is disabled.
  // *  
  // * @param  __PLLI2SMUL__ specifies the multiplication factor for PLLI2S VCO output clock
  // *          This parameter can be one of the following values:
  // *             @arg @ref RCC_PLLI2S_MUL8 PLLI2SVCO = PLLI2S clock entry x 8
  // *             @arg @ref RCC_PLLI2S_MUL9 PLLI2SVCO = PLLI2S clock entry x 9
  // *             @arg @ref RCC_PLLI2S_MUL10 PLLI2SVCO = PLLI2S clock entry x 10
  // *             @arg @ref RCC_PLLI2S_MUL11 PLLI2SVCO = PLLI2S clock entry x 11
  // *             @arg @ref RCC_PLLI2S_MUL12 PLLI2SVCO = PLLI2S clock entry x 12
  // *             @arg @ref RCC_PLLI2S_MUL13 PLLI2SVCO = PLLI2S clock entry x 13
  // *             @arg @ref RCC_PLLI2S_MUL14 PLLI2SVCO = PLLI2S clock entry x 14
  // *             @arg @ref RCC_PLLI2S_MUL16 PLLI2SVCO = PLLI2S clock entry x 16
  // *             @arg @ref RCC_PLLI2S_MUL20 PLLI2SVCO = PLLI2S clock entry x 20
  // *   
  // */
// #define __HAL_RCC_PLLI2S_CONFIG(__PLLI2SMUL__)\
          // MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PLL3MUL,(__PLLI2SMUL__))

