zuzya3010/hoverboard-AT32F413RCT7/Drivers/AT32F4xx_HAL_Driver/Inc/at32f4xx_hal_rcc_ex.h
// /**
  // * @}
  // */

// /** @defgroup RCCEx_I2S_Configuration I2S Configuration
  // * @brief  Macros to configure clock source of I2S peripherals.
  // * @{
  // */  

// /** @brief  Macro to configure the I2S2 clock.
  // * @param  __I2S2CLKSOURCE__ specifies the I2S2 clock source.
  // *          This parameter can be one of the following values:
  // *            @arg @ref RCC_I2S2CLKSOURCE_SYSCLK system clock selected as I2S3 clock entry
  // *            @arg @ref RCC_I2S2CLKSOURCE_PLLI2S_VCO PLLI2S VCO clock selected as I2S3 clock entry
  // */
// #define __HAL_RCC_I2S2_CONFIG(__I2S2CLKSOURCE__) \
                  // MODIFY_REG(RCC->CFGR2, RCC_CFGR2_I2S2SRC, (uint32_t)(__I2S2CLKSOURCE__))

// /** @brief  Macro to get the I2S2 clock (I2S2CLK).
  // * @retval The clock source can be one of the following values:
  // *            @arg @ref RCC_I2S2CLKSOURCE_SYSCLK system clock selected as I2S3 clock entry
  // *            @arg @ref RCC_I2S2CLKSOURCE_PLLI2S_VCO PLLI2S VCO clock selected as I2S3 clock entry
  // */
// #define __HAL_RCC_GET_I2S2_SOURCE() ((uint32_t)(READ_BIT(RCC->CFGR2, RCC_CFGR2_I2S2SRC)))

// /** @brief  Macro to configure the I2S3 clock.
  // * @param  __I2S2CLKSOURCE__ specifies the I2S3 clock source.
  // *          This parameter can be one of the following values:
  // *            @arg @ref RCC_I2S3CLKSOURCE_SYSCLK system clock selected as I2S3 clock entry
  // *            @arg @ref RCC_I2S3CLKSOURCE_PLLI2S_VCO PLLI2S VCO clock selected as I2S3 clock entry
  // */
// #define __HAL_RCC_I2S3_CONFIG(__I2S2CLKSOURCE__) \
                  // MODIFY_REG(RCC->CFGR2, RCC_CFGR2_I2S3SRC, (uint32_t)(__I2S2CLKSOURCE__))

// /** @brief  Macro to get the I2S3 clock (I2S3CLK).
  // * @retval The clock source can be one of the following values:
  // *            @arg @ref RCC_I2S3CLKSOURCE_SYSCLK system clock selected as I2S3 clock entry
  // *            @arg @ref RCC_I2S3CLKSOURCE_PLLI2S_VCO PLLI2S VCO clock selected as I2S3 clock entry
  // */
// #define __HAL_RCC_GET_I2S3_SOURCE() ((uint32_t)(READ_BIT(RCC->CFGR2, RCC_CFGR2_I2S3SRC)))

// /**
  // * @}
  // */

// #endif /* STM32F105xC || STM32F107xC */
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCCEx_Exported_Functions
  * @{
  */

/** @addtogroup RCCEx_Exported_Functions_Group1
  * @{
  */

HAL_StatusTypeDef HAL_RCCEx_PeriphCLKConfig(RCC_PeriphCLKInitTypeDef  *PeriphClkInit);
void              HAL_RCCEx_GetPeriphCLKConfig(RCC_PeriphCLKInitTypeDef  *PeriphClkInit);
uint32_t          HAL_RCCEx_GetPeriphCLKFreq(uint32_t PeriphClk);

/**
  * @}
  */

// #if defined(STM32F105xC) || defined(STM32F107xC)
// /** @addtogroup RCCEx_Exported_Functions_Group2
  // * @{
  // */
// HAL_StatusTypeDef HAL_RCCEx_EnablePLLI2S(RCC_PLLI2SInitTypeDef  *PLLI2SInit);
// HAL_StatusTypeDef HAL_RCCEx_DisablePLLI2S(void);

// /**
  // * @}
  // */

// /** @addtogroup RCCEx_Exported_Functions_Group3
  // * @{
  // */
// HAL_StatusTypeDef HAL_RCCEx_EnablePLL2(RCC_PLL2InitTypeDef  *PLL2Init);
// HAL_StatusTypeDef HAL_RCCEx_DisablePLL2(void);

// /**
  // * @}
  // */
// #endif /* STM32F105xC || STM32F107xC */

/**
  * @}
  */

/**
  * @}
  */
  
/**
  * @}
  */
  
#ifdef __cplusplus
}
#endif

#endif /* __STM32F1xx_HAL_RCC_EX_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

